Repository: cassidyjames/ideogram
Catalog: po/*.po
Languages: pl, pt, tr

source: Insert emoji anywhere 🎉
pl: Wstaw emoji gdziekolwiek 🎉
pt: Insira símbolos de emojis em todo o lado 🎉
tr: Herhangi bir yere emoji ekleyin 🎉

source: Quickly insert emoji anywhere you can paste text, including non-native apps. Hit ⌘+E to open the emoji picker, choose the emoji you want, and it’s instantly copied and pasted into any focused text input. 👍
pl: Szybko wstawiaj emoji wszędzie tam, gdzie możesz wkleić tekst, również w aplikacjach nienatywnych. Wciśnij ⌘+E, żeby otworzyć okienko wyboru i wybierz emoji, które zostanie skopiowane i wklejone do aktywnego pola tekstowego. 👍
pt: Insira emojis rapidamente em qualquer lado que conseguir colar texto, incluindo aplicações não nativas. Pressione ⌘+E para abrir o selecionador de emojis, escolha o emoji que quiser e este é copiado e colado instantaneamente em qualquer campo de texto selecionado. 👍
tr: Yerel olmayan uygulamalar da dahil olmak üzere metni yapıştırabileceğiniz her yere hızla emoji ekleyin.Emoji seçiciyi açmak için ⌘ + E tuşlarına basın, istediğiniz emojiyi seçin.anında kopyalanıp herhangi bir odaklanmış metin girişine yapıştırılır. 👍

source: Not feeling the default keyboard shortcut? Head to System Settings → Keyboard → Shortcuts → Custom to set it to anything you’d like. 😀️
pt: Não gosta do atalho de teclado padrão? Vá a Definições de Sistema → Teclado → Atalhos → Personalizar para defini-lo ao seu gosto. 😀️

source: Refreshed icons thanks to Micah Ilbery
pt: Ícones atualizados por Micah Ilbery

source: Fix .desktop translation error
pt: Correção de erro de tradução em .desktop

source: Translation updates
pl: Aktualizacje tłumaczeń
pt: Atualizações de traduções
tr: Çeviri güncellemeleri

source: Danish translations thanks to Rasmus Lindegaard
pt: Traduções em Dinamarquês por Rasmus Lindegaard

source: Polish translations thanks to Michał Nowakowski
pt: Traduções em Polaco por Michał Nowakowski

source: Code cleanup
pl: Czyszczenie kodu
pt: Limpeza de código
tr: Kod temizleme

source: Fixed GTK_CSD issue on other OSes
pl: Poprawiono błąd z GTK_CSD na innych OS
pt: Corrigido um problema com o GTK_CSD em outros sistemas operativos
tr: Diğer işletim sistemlerinde GTK_CSD sorunu düzeltildi

source: Improved code style
pl: Ulepszony styl kodu
pt: Melhorias do estilo de código
tr: Geliştirilmiş kod stili

source: Dutch translations thanks to Heimen Stoffels
pl: Niderlandzkie tłumaczenie dzięki Heimenowi Stoffelsowi
pt: Traduções em Holandês por Heimen Stoffels
tr: Heimen Stoffels Hollandaca çeviri

source: Italian translations thanks to Mirko Brombin
pl: Włoskie tłumaczenie dzięki Mirko Brombinowi
pt: Traduções em Italiano por Mirko Brombin
tr: Mirko Brombin Italyanca çeviri

source: Galacian translations thanks to @riesp
pl: Galicyjskie tłumaczenie dzięki @riesp
pt: Traduções em Galego por @riesp
tr: @Riesp Galiçya çeviri

source: ¡Hola! Spanish translations thanks to Alain (@alainm23)
pl: ¡Hola! Hiszpańskie tłumaczenie dzięki Alainowi (@alainm23)
pt: ¡Hola! Traduções em Espanhol por Alain (@alainm23)
tr: ¡Hola! Alain İspanyolca çeviri(@ alainm23)

source: Bonjour! French translations thanks to @NathanBnm
pl: Bonjour! Francuskie tłumaczenie dzięki Nathanowi Bonnemainsowi
pt: Bonjour! Traduções em Francês por @NathanBnm
tr: Bonjour! Fransızca çeviri @NathanBnm

source: Ideogram is now translatable.
pl: Ideogram można teraz tłumaczyć.
pt: O Ideogram é agora traduzível.
tr: İdeogram artık çevrilebilir.

source: Happy new year! This release contains AppData fixes.
pl: Szczęśliwego nowego roku! To wydanie zawiera poprawki AppData.
pt: Feliz ano novo! Este lançamento contém correções dos dados da aplicação.
tr: Yeni Yılınız mutlu olsun! Bu sürüm, AppData düzeltmelerini içerir.

source: More reliable styling
pl: Bardziej niezawodna stylizacja
pt: Estilo mais confiável
tr: Daha güvenilir stil

source: ℹ More descriptive in-app copy and a yellow accent color.
pl: ℹ Lepsze opisy wewnątrz apki i żółty kolor akcentu.
pt: ℹ Texto mais descritivo dentro da aplicação e uma cor de destaque amarela.
tr: ℹ Daha açıklayıcı uygulama içi metin ve sarı vurgu rengi.

source: ⌨ Set a default keyboard shortcut (⌘+E).
pl: ⌨ Ustawiono skrót klawiszowy (⌘+E).
pt: ⌨ Atalho de teclado padrão definido (⌘+E).
tr: ⌨ Varsayılan bir klavye kısayolu ayarlayın (⌘ + E).

source: 🎉 Initial release for AppCenter
pl: 🎉 Początkowe wydanie dla AppCenter
pt: 🎉 Lançamento inicial para o Centro de Aplicações
tr: 🎉 AppCenter için ilk sürüm

source: Emoji Input
pl: Wstawianie emoji
pt: Entrada de Emoji
tr: Emoji Girişi

source: Insert emoji anywhere
pl: Wstaw emoji gdziekolwiek
pt: Insira emojis em todo o lado
tr: Herhangi bir yere emoji ekleyin

source: emoji;insert;copy;paste;emoticons;smiley;smilies;pictures;icons;keyboard;☺;
pl: " "emoji;wstawianie;kopiowanie;wklejanie;emotikony;uśmieszki;obrazki;ikony;klawiatura;☺
pt: emoji;inserir;copiar;colar;emoticons;smiley;smilies;imagens;ícones;teclado;☺;
tr: emoji; ekle; kopyala; yapıştır; ifadeler; gülen yüzler; ifadeler; resimler; simgeler; klavye; ☺;

source: Select Emoji to Insert
pl: Wybierz emoji
pt: Selecione um emoji para inserir
tr: Eklenecek Emojiyi Seçin

source: Selecting will copy the emoji to the clipboard and paste into any focused text input.
pl: Wybranie skopiuje emoji do schowka i wklei do aktywnego pola tekstowego.
pt: Ao selecionar vai copiar o emoji para a área de transferência e colá-lo em qualquer campo de texto selecionado.
tr: Seçmek, emojiyi panoya kopyalar ve herhangi bir odaklanmışmetin girişi.

source: Not feeling the default keyboard shortcut? Head to System Settings → Keyboard → Shortcuts → Custom to set it to anything you’d like.
pl: Nie czujesz domyślnego skrótu klawiszowego? Zajrzyj do Ustawienia systemowe → Klawiatura → Skróty → Własny, żeby ustawić cokolwiek chcesz.
tr: Varsayılan klavye kısayolunu hissetmiyor musunuz? Sistem Ayarlarına Git →İstediğiniz herhangi bir şeye ayarlamak için Klavye → Kısayollar → Özel.
